app/controllers/user_controller.rb

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
---
	def data_for_wp
		if params[:key].to_s == "d0c0e3d43f100c138b2142fd48eaac32"
			@usuario = Usuario.find(:first, :conditions => ["usuario = ?",params[:u]])

SELECT `usuarios`.* FROM `usuarios` WHERE (id = '75' AND token = 'a35b78fe9865ad4e2f52') LIMIT 1
---
	def editPublico
		@id = params[:id]
		@t = params[:t]
		@usuario = Usuario.find(:first, :conditions => ["id = ? AND token = ?",@id,@t])

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
---
	def edit
		if isAdmin? || editMyOwnUser?(params[:id])
			@usuario = Usuario.find(params[:id])

SELECT `usuarios`.`id` FROM `usuarios` WHERE (usuario = 'rodrigomt' AND admin= 'si') LIMIT 1
UPDATE `usuarios` SET `carrera` = 'Arquitectura', `mail` = 'cf_landa@hotmail.com' WHERE (`usuarios`.`id` = 127)
---
	def update
		@usuario = Usuario.find(params[:id])
		if isAdmin? || params[:t] == @usuario.token || editMyOwnUser?(params[:id])
			if params[:usuario][:password]
				if params[:usuario][:password] == params[:contrasena_rep]
					@usuario.password = Digest::SHA1.hexdigest("#{params[:usuario][:password]}")
					@usuario.save!

SELECT `usuarios`.`id` FROM `usuarios` WHERE (`usuarios`.`usuario` = 'rodrigomoya') LIMIT 1
INSERT INTO `usuarios` (`twitter`, `mail`, `telefono_cel`, `pais`, `mail_send`, `wikipage`, `usuario`, `token`, `apellido`, `carrera`, `telefono_fijo`, `direccion`, `admin`, `rut`, `web`, `tipo`, `flickr`, `mail_2`, `bio`, `password`, `o_uid`, `o_token`, `nombre`, `mail_3`, `o_provider`, `last_edit`, `anoingreso`, `o_user_id`, `ciudad`) VALUES (NULL, 'rodrigo+4@citisent.com', NULL, NULL, NULL, '', 'rodrigomoya4', NULL, 'Moya Toro 4', 'Arquitectura', NULL, NULL, 'no', '15068750-1', NULL, 'p', NULL, NULL, NULL, '1dvuvvdu', NULL, NULL, 'Rodrigo', NULL, NULL, NULL, 2003, NULL, NULL)
---
	def create
		@usuario = Usuario.new(params[:usuario])
		@mail = params[:usuario][:mail]
		@username = params[:usuario][:usuario]
		@wikipage = "#{params[:usuario][:nombre]} #{params[:usuario][:apellido]}"
		@capt = params[:capt]
		@flag = 0
		@capt_cookie = cookies[:capt]
		if verify_recaptcha == true
			if Usuario.exists?(:usuario=>@username)
				flash[:notice] = "El usuario #{@username} ya existe!!"
				@flag=1
				if Usuario.exists?(:mail=>@mail)
					flash[:notice] = "El email #{@mail} ya existe!!"
					@flag=1
					if @usuario.apellido.blank?
						flash[:notice] = "El campo Apellido esta vacio"
						@flag=1
					end
				end
			end
			if (@flag==0)
				if @usuario.save

UPDATE `usuarios` SET `token` = '6F4B2CCCF0', `password` = '55dcff4d8986ed98305b0be9789a10032e5bcf53' WHERE (`usuarios`.`id` = 2164)
---
						}}"
						casiopea_page = create_wikipage(@wikipage,@data,params[:usuario][:bio])
						@usuario.wikipage = "http://wiki.ead.pucv.cl/index.php?title="+casiopea_page.to_s
						@usuario.save!

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigoToro' )
---
	def checkUser
		@usuario = Usuario.find(:all, :conditions => ["usuario = ? ", params[:user]])

SELECT `usuarios`.* FROM `usuarios` WHERE (mail = 'roromt' )
---
	def checkMail
		@usuario = Usuario.find(:all, :conditions => ["mail = ? ", params[:mail]])

SELECT `usuarios`.* FROM `usuarios` WHERE (mail = 'roromt@gmail.com') LIMIT 1
---
	def enviaRecuperaMail
		@tipo ="recupera"
		@usuario = Usuario.find(:first, :conditions => ["mail = ?", params[:mail]])